import React, { Component } from "react";

export class About extends Component {
  constructor(props) {
    super(props);
    this.state = {};
  }

  render() {
    return (
      <div className="container">
        <h2>מהו בנק הזמן?</h2>
        <h6>
          כל יום הוא חשבון בנק, וזמן הוא המטבע. אף אחד לא עשיר, אף אחד לא עני -
          לכל אחד מאיתנו יש 24 שעות. (כריסטופר רייס)
        </h6>
        <p>
          בנק הזמן מתייחד במספר דברים: 1. אי אפשר לשדוד אותו 2. קל מאד להתעשר 3.
          אין ירושות - כל הון הוא הון עצמי! בבנק הזמן שותפים משתמשים רבים. לכל
          משתמש חשבון עו"ש, ממש כבכל בנק אחר, אך בבנק הזמן המטבע העובר לסוחר הנו
          - זמן, במטבעות של שעות.
        </p>
        <br />
        <p>
          .כל משתמש נדרש לציין בעת פתיחת חשבונו באילו תחומים הנו מעוניין / מוכשר
          / יכול לתרום לקהילה
        </p>
        <br />
        <p>
          כל תרומת שעה נרשמת בחשבון העו"ש כהפקדה של שעה. במקביל יכול המשתמש
          להעיזר בשירותיו של משתמש אחר וכך "למשוך" שעות מן היתרה שצבר. בבנק הזמן
          מתנהל סחר - מכר ענף ועירני של שירותים וסיוע, איש איש בתחומו הוא. כל
          אחד יכול למצוא את מקומו עפ"י החוזקות והחולשות האישיים שלו. לתשומת לב -
          מכירת שירותים בתמורה לתשלום בכסף "אמיתי" אסורה בבנק הזמן!
        </p>
        <hr />
        <h6>כיום בבנק הזמן:</h6>
        <p>X משתמשים בתחום Y...</p>
      </div>
    );
  }
}
