import React, { Component } from "react";
import ReactHtmlParser, {
  processNodes,
  convertNodeToElement,
  htmlparser2
} from "react-html-parser";

export class CategoryInfo extends Component {
  constructor(props) {
    super(props);
    this.state = {};
    this.back = this.back.bind(this);
  }
  componentDidMount() {}
  back() {
    this.props.history.push("/");
  }
  render() {
    const queryParams = this.props.history.location.search;
    const categoryName = queryParams.split("=")[1];
    console.log(categoryName);
    const Categories = [
      {
        name: "baby",
        text: `<h3>שמרטפות</h3><p>שמרטף, שומר טף או באנגלית בייביסיטר, הוא אדם השומר על תינוק או ילד,  בזמן שהוריו לא נמצאים כדי לטפל בו.<br/>
        <b> רוצים לצאת לבלות? תור לרופא? מוכרחים לרוץ לסופר לפני שנסגר? מסעדה חדשה שאתם רוצים לבדוק הערב?</b> 
        <br/>בבנק הזמן תוכלו למצוא שמרטפים - מתנדבים שיטפלו בילדכם.<br/>
        בפנייה לשמרטף - מתנדב נא ציינו מספר ילדים, גילאים ושעות נדרשות
        <br/><b>אוהבים ילדים? חושבים שאין כמו ריח של תינוק?</b>
        <br/>הפקידו בחשבונכם שעות שמרטפות
        </p>
        `
      },
      {
        name: "tv",
        text: `<h3>עזרה טכנולוגית</h3><p>טכנולוגיה (מיוונית: טכנו (Τεχνο) = אומנות, לוגיה (Λογία) = תורה; כלומר: תורת האומנות) היא תחום דעת העוסק בחיפוש פתרונות מעשיים כמענה לרצונות וצרכים, תוך ניצול חידושי המדע. 
<br/><b>סובלים מטכנופוביה? מרגישים שאיבדתם את זה? רוצים לבצע איזושהי פעולה ולא ממש יודעים איך?</b>
<br/>פנו לעזרת המתנדבים שלנו שישמחו לסייע לכם בתמיכה טכנית ויסבירו לכם בסבלנות כיצד להפעיל את המכשירים שברשותכם.

<br/><b>חובבי טכנולוגיה? עוקבים אחר כל מוצר חדש?</b>
<br/> בואו לעשות משהו טוב עם השליטה שלכם בשוק המתפתח ללא הרף ולסייע לאלו שמתקשים להשתלב ולעקוב אחר השינויים
</p>
`
      },
      {
        name: "pen",
        text: `<h3>כתיבה וניסוח</h3><p>עט, דיו ונייר מפחידים אותי יותר מחרב ומאקדח.
- אלכסנדר דיומא
<br/><b>קניתם מתנה ורציתם לצרף כמה מילות ברכה? רוצים להביע הוקרה, תודה, אהבה או אכזבה אבל שום דבר קריא לא יצא?</b>
<br/>פנו לעזרת המתנדבים הכותבים שלנו, שינסחו עבורכם כל מה שרציתם להגיד
<br/><b>
טובים בניסוח? המילים נוזלות לכם מקצה העט? אוהבים את התרפיה והסיפוק שבכתיבה יפה?</b>
<br/>בואו לעזור למשתמשים האחרים להעביר את המילים שלהם מן הלב אל הדף.</p>
`
      },
      {
        name: "motorcycle",
        text: `<h3>שליחויות</h3><p> שילוח אקספרס תוך מספר שעות ובהתראות קצרות, הקפדה על ביצוע מקצועי. שליחות מדלת לדלת, שליחויות מהיום להיום, הפצת משלוחים/ חבילות.
<br/><b>גשם זלעפות? חום אימים?קור כלבים? מזג אוויר נוח אבל סתם כך אין לכם כוח / יכולת לצאת מהבית?</b>
<br/>המשלוחנים - המתנדבים שלנו יאספו עבורכם תרופות מבית המרקחת, חבילות מן הדואר וכל מה שאתם זקוקים לו ונמצא מחוץ לבית
<br/><b>מסתובבים הרבה בדרכים? אוהבים לרכב על אופנוע או לנהוג ברכב?</b>
<br/>אספו אתכם בדרך שליחויות קטנות</p>
`
      },
      {
        name: "cap",
        text: `<h3>מורים פרטיים</h3><p> מורה פרטי הוא מדריך או מורה אשר מלמד נושא לימודי מסוים לתלמיד יחיד או לקבוצה קטנה של תלמידים במתכונת אשר נקראת שיעור פרטי. תשומת לב כזו מאפשרת לתלמיד לשפר ידע או מיומנויות מהר יותר מאשר בסביבה של כיתה.
<br/><b> מעוניינים להתמקצע בתחום נוסף,לרכוש ידע או סתם כתחביב?</b>
<br/>מגוון רחב של בעלי ידע, החל באמנויות הנגינה, הציור, הכיור או הפיסול וכלה בתחומי למידה מקצועיים כמו מתמטיקה, אנגלית או דקדוק ועוד ועוד
<br/><b>אלופים בתחום מסוים? אוהבים ללמד?</b>
<br/>בואו להעביר את הידע שלכם הלאה
</p>
`
      },
      {
        name: "dog",
        text: `<h3>דוגיסיטר</h3><p>כל מי שיש לו כלב בבית יודע, שאחת המטלות הכי פחות נעימות שיש היא להוציא אותו החוצה לטיול. צריך לזכור, ההמלצה היא להוציא את הכלב שלוש פעמים, לפחות חצי שעה בכל פעם.
<br/><b>עמוסים במבחנים? נוסעים לטיול?</b>
<br/>היעזרו במתנדבים שלנו שיטיילו עם הכלב שלכם
<br/><b>אוהבים כלבים? אוהבים לטייל בחוץ?</b>
<br/>התנדבו לטייל עם חיות המחמד של יתר המשתמשים</p>
`
      },
      {
        name: "car",
        text: `<h3>הסעות</h3><p>טרמפ, או "הקפצה", הוא דרך של שימוש תחבורה פרטית, בה מקבל נוסע הסעה מאדם אחר, בדרך כלל מנהגי מכוניות פרטיות.
<br/><b>אין לכם רכב? קשה לכם להטלטל בתחבורה ציבורית? צריכים לקפוץ לכמה דקות אל מחוץ לשכונה?</b>
<br/>חייגו אלינו ובדקו האם נהג מתנדב נוסע כעת לכיוון שלכם
<br/><b>בעלי רכב? נוסעים במסלול קבוע? יש לכם מקום פנוי?</b>
<br/>לפני צאתכם לדרך בדקו איתנו האם משתמש מעוניין להצטרף אליכם
</p>
`
      },
      {
        name: "hamburger",
        text: `<h3>ארוחה חמה</h3><p>בחברה האנושית נהוג להקדיש פרקי זמן במהלך היום לאכילה. ברוב החברות המודרניות מתקיימת שגרה של כשלוש ארוחות במהלך היום - ארוחת בוקר, ארוחת צהריים וארוחת ערב. בנוסף להן או במקומן, קיים מגוון של ארוחות ביניים.
<br/><b>אחרי לידה? עייפים משבוע עמוס? לא חשים בטוב?</b>
<br/>היעזרו בשירות הארוחות החמות שלנו, ארוחות המבושלות בתנאים הגייניים וביד אוהבת במטבחי הבשלנים המתנדבים שלנו
<br/><b>אוהבים את המטבח? נהנים מהסיפוק שבהאכלת גדוד אנשים רעבים?</b>
<br/>בואו לבשל בבנק הזמן
</p>
`
      },
      {
        name: "tools",
        text: `<h3>תחזוקה ותיקונים</h3><p>צביעת הבית, חשמל, אינסטלציה, הרכבה של מיטות ושידות, תלייה של מדפים, תיקון תריסים והתקנה של אביזרי בטיחות.
<br/><b>ניחתנם בשתי ידיים שמאליות? לא יודעים מאיזה צד מפעילים את המקדחה? אין לכם בכלל ארגז כלים?</b>
<br/>הזעיקו את ההנדימנים המתנדבים שלנו שיבצעו עבורכם תיקונים קלים ועבודות תחזוקה שונות בביתכם
<br/><b>אוהבים לנגר, לסייד, לשייף או לתקן?</b>
<br/>הפקידו שעות עבודות תחזוקה בחשבונכם בבנק
</p>
`
      }
    ];
    var content = "";
    content = Categories.find(ele => ele.name == categoryName);

    return (
      <div className="categoryDiv">
        <img className="logo" src={require("../assets/bank.jpg")} />
        <div>
          <p className="categoryinfo"> {ReactHtmlParser(content.text)}</p>
          <button type="button" className="btn btn-dark" onClick={this.back}>
            חזרה לדף הבית
          </button>
        </div>
      </div>
    );
  }
}
